[
  {
    "title": "Mantra post-OM token crash statement leaves key questions unanswered",
    "author": "",
    "date": "",
    "content": "An April 16 announcement titled “Statement of Events: 13 April 2025” reiterates that the crash did not involve any token sales by the project itself, and the Mantra team remains fully functional and continues investigating the incident.\n\nThe post also reiterated that there are two types of OM tokens, with one being Ethereum-based (ERC-20) and the other running on Mantra’s mainnet.\n\nAdditionally, the post mentions a divergence in OM spot prices on OKX and Binance. The discrepancy began around 6:00 pm UTC, around an hour before the OM token’s crash, according to CoinGecko.\n\nRelated: Mantra CEO plans to burn team’s tokens in bid to win community trust\n\nAs previously reported by Cointelegraph, OKX CEO Star Xu called Mantra a “big scandal” in a post published hours following the crash. Mantra CEO Mullin also said Binance is the biggest holder of the OM token, citing Etherscan records.\n\nMagazine: Memecoins are ded — But Solana ‘100x better’ despite revenue plunge",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc4a25dd37548f9ecad48/",
    "crawl_time": "2025-04-16T23:03:55.220411"
  },
  {
    "title": "Bitget Unveils New Ad Featuring FC Barcelona Star Raphinha to Champion Smarter Crypto Solutions",
    "author": "",
    "date": "",
    "content": "Bitget, the leading cryptocurrency exchange, and Web3 company, is kicking off a dynamic new campaign with LALIGA, featuring Barcelona’s electrifying winger Raphinha.\n\nEstablished in 2018, Bitget is the world’s leading cryptocurrency exchange and Web3 company. Serving over 100 million users in 150+ countries and regions, the Bitget exchange is committed to helping users trade smarter with its pioneering copy trading feature and other trading solutions while offering real-time access to Bitcoin price, Ethereum price, and other cryptocurrency prices.\n\nBitget is at the forefront of driving crypto adoption through strategic partnerships, such as its role as the Official Crypto Partner of the World’s Top Football League, LALIGA, in EASTERN, SEA and LATAM markets, as well as a global partner of Turkish National athletes Buse Tosun Çavuşoğlu (Wrestling world champion), Samet Gümüş (Boxing gold medalist) and İlkin Aydın (Volleyball national team), to inspire the global community to embrace the future of cryptocurrency.\n\nFor more information, visit: Website | Twitter | Telegram | LinkedIn | Discord | Bitget Wallet",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc4a15dd37548f9ecad46/",
    "crawl_time": "2025-04-16T23:04:01.998100"
  },
  {
    "title": "Join the Apertum Airdrop Exclusive on CoinMarketCap and Earn USDT!",
    "author": "",
    "date": "",
    "content": "Apertum ($APTM) is offering a prize pool of 5,000 USDT by completing simple tasks!\n\nTake part in the official Apertum Airdrop today and earn rewards by participating in the ongoing CMC Quest, running from April 16 to April 29.\n\nApertum is an EVM-compatible Layer 1 blockchain, built as a Subnet on Avalanche. Its DAO-driven ecosystem enables efficient smart contract deployment, Web3 integration, dApp support, and developer-friendly infrastructure, incorporating a deflationary model to enhance long-term sustainability.\n\nThat's it! Simply complete these 3 simple tasks to be in the running for one of 50 prizes, each valued at 100 USDT.\n\nDon’t miss your chance to be part of the Apertum revolution and earn rewards while supporting the next generation of blockchain technology. Join now and start completing your tasks!",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc3c74b211b3dcc9fe6a4/",
    "crawl_time": "2025-04-16T23:04:08.382387"
  },
  {
    "title": "Aergo Token Climbs After Exchange Listings",
    "author": "",
    "date": "",
    "content": "You can also read this news on BH NEWS: Aergo Token Climbs After Exchange Listings\n\nThe Aergo token has seen a significant uptick in value following crucial announcements from major cryptocurrency platforms. In just one day, the token surged by 18%, hitting a new high of $0.51, igniting enthusiasm among the crypto community. The renewed interest from traders is closely linked to the recent decision by Binance regarding perpetual contracts.\n\nBinance’s announcement of perpetual contracts for Aergo in USDT trading pairs has taken the market by storm. Following this update, the token’s price soared to $0.51, with reports indicating a 23% hike in its value. This move has drawn considerable attention from traders eager to capitalize on the opportunity.",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc3897618da558f0591da/",
    "crawl_time": "2025-04-16T23:04:24.954217"
  },
  {
    "title": "DWF Labs buys $25M of Trump’s WLFI tokens in US market expansion drive",
    "author": "",
    "date": "",
    "content": "DWF Labs acquired a strategic stake in World Liberty Fi, by acquiring WLFI tokens valued at $25M. The fund has not mentioned an acquisition price or the size of the on-chain portfolio. However, the known addresses of the DWF Labs market maker are not yet among the top holders of WLFI.\n\n“The U.S. is the world’s largest single market for digital asset innovation,” said Andrei Grachev, Managing Partner of DWF Labs.\n\n“Our physical presence reflects our confidence in America’s role as the next growth region for institutional crypto adoption. Moreover, the USD1 stablecoin and forthcoming global DeFi solutions align with our broader mission to improve financial services,” he said.\n\nWorld Liberty Fi is also starting preliminary tests of offering DeFi operations. In the past week, the fund made a minting test for 1 USDC, signaling the fund may be able to boost liquidity in one of the most widely accepted regulated stablecoins.\n\nCryptopolitan Academy: Coming Soon - A New Way to Earn Passive Income with DeFi in 2025. Learn More",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc262f96a7b58f9915b06/",
    "crawl_time": "2025-04-16T23:04:31.623516"
  },
  {
    "title": "Crypto Winter Is Here: Coinbase Says the Chill Has Already Begun",
    "author": "",
    "date": "",
    "content": "In a report dropped on Tuesday, Coinbase pointed out a bunch of signs showing the market is dropping fast.\n\nAlso Read: Can Solana Price Break $150 with Canada ETF Hype?",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc2634b211b3dcc9fe69c/",
    "crawl_time": "2025-04-16T23:04:43.897524"
  },
  {
    "title": "Binance Introduces AERGOUSDT Perpetual Contract with 15x Leverage",
    "author": "",
    "date": "",
    "content": "The introduction of this AERGOUSDT perpetual contract signifies Binance's focus on expanding its derivatives market. The announcement follows similar product launches aimed at expanding trading options.\n\nBinance, the largest crypto exchange by trading volume, has introduced the AERGOUSDT perpetual contract, which offers up to 15x leverage to traders. This move is consistent with Binance's strategy of frequently expanding its trading products to meet market demand. Aergo, an enterprise blockchain, is the central asset in this new contract, developed by South Korean company Blocko, which is supported by Samsung.\n\nMarket reactions include a notable price surge in Aergo, which hit a 24-hour increase of over 20%, peaking at $0.51. While executive commentary from Binance's leadership is absent, a trader discussion highlights the leverage and margin factors introduced with the new product.\n\nDid you know? In past instances, such as the September 2024 launch, Aergo perpetual contracts didn't result in significant long-term price changes, highlighting the speculative nature of derivatives.\n\nAergo's current price stands at $0.29, showing a 24-hour decline of 29.86%, while a one-week increase reflectively stands at 130.76%. The market cap is valued at $137.78 million, with a daily trading volume of $1.41 billion. This highlights significant fluctuations following the Binance contract launch.\n\nThe Coincu research team observes that the introduction of high-leverage products in a volatile environment can amplify market exposure and risk. The historical performance of similar Binance initiatives suggests a potential for increased trading volume, though not necessarily a sustained price change. Such launches often spur liquidity and speculative trading activity.",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc2636bcc4054fa593574/",
    "crawl_time": "2025-04-16T23:04:50.127064"
  },
  {
    "title": "XRP $2 Level at Risk in Fresh Market Sell-off: What Comes Next?",
    "author": "",
    "date": "",
    "content": "Cryptocurrencies, including XRP, are down in the early Wednesday session as fresh selling pressure emerged on the markets. Bitcoin (BTC) and major cryptocurrencies dipped over 3% as profit-taking ensued after Tuesday's rally. XRP followed a similar trend, dropping 4.55% in the last 24 hours to $2.07.\n\nThe sentiment on the equity and cryptocurrency markets turned sour late Tuesday as Nvidia shares fell in after-hours trading, with the sell-off extending into the early Wednesday session. In the last 24 hours, the crypto market has faced $240 million in liquidations, according to CoinGlass data.",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc2637618da558f0591d8/",
    "crawl_time": "2025-04-16T23:04:56.236539"
  },
  {
    "title": "Aergo Token Surges as Major Exchanges Announce Listings",
    "author": "",
    "date": "",
    "content": "You can also read this news on COINTURK NEWS: Aergo Token Surges as Major Exchanges Announce Listings\n\nThe Aergo token has experienced a notable surge following significant announcements from the Binance and DigiFinex exchanges. Within just one day, the token rose by 18%, reaching a new peak of $0.51. The developments, which have sparked excitement within the community, have allowed Aergo to regain investor interest, particularly due to Binance’s decision regarding perpetual contracts.\n\nIn the cryptocurrency market, exchange announcements can quickly influence investor psychology. As seen with Aergo, price movements are shaped not just by technical analysis but also by the decisions made by exchanges. Recent developments have increased medium-term optimism towards Aergo.\n\nThe post Aergo Token Surges as Major Exchanges Announce Listings appeared first on COINTURK NEWS.",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc2646bcc4054fa593576/",
    "crawl_time": "2025-04-16T23:05:02.661591"
  },
  {
    "title": "Michael Saylor’s Bold Chess Move Sends Bitcoin Traders into Frenzy",
    "author": "",
    "date": "",
    "content": "Strategy CEO Michael Saylor subtly conveyed his perspective today amidst a tense trading session for Bitcoin. According to a post shared by Saylor, an AI-generated image depicted him calmly seated at a chessboard with the caption, “Bitcoin is Chess.”\n\nAlso Read: ProShares Sets April 30 Target for XRP Futures ETF as Spot Hopes Surge\n\nFinancial experts agree that Saylor’s chess analogy shows how he shares a strategic investment approach backed by systematic planning. Strategy’s management refuses to give into panic-driven market reactions or short-term forecasts while focusing on building stability and advancing its strategies.\n\nThrough its composition, the image communicates that Saylor maintains self-assurance even when markets exhibit unpredictability. Financial market participants could interpret this indication as evidence that Strategy plans to keep its Bitcoin investment decisions well-planned and stable. Current market movements demonstrate that Bitcoin investors are showing concern about short-term price behavior and showing signs of hesitant behavior.\n\nAlso Read: Michael Saylor Defends Bitcoin as Prices Drop After Trump Tariff Shock\n\nThe post Michael Saylor’s Bold Chess Move Sends Bitcoin Traders into Frenzy appeared first on 36Crypto.",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc1307618da558f0591d2/",
    "crawl_time": "2025-04-16T23:05:08.726833"
  },
  {
    "title": "3iQ Corp. Launches Canadian Solana Staking ETF",
    "author": "",
    "date": "",
    "content": "3iQ Corp. introduced the new Solana ETF with the help of Figment, a renowned staking provider, known for its extensive experience in secure and compliant staking solutions. Pascal St-Jean, CEO of 3iQ Corp., emphasized innovation in regulated digital asset investments.\n\nSOLQ integrates Solana’s native staking rewards into its investment framework, offering 6%-8% annual yields, according to 3iQ’s projections. The Ontario Securities Commission's approval demonstrates Canada’s supportive regulatory stance for crypto-based financial products.\n\nExperts highlight the ETF's launch as a pivotal moment for institutional acceptance of staking products, promising enhanced participation and security in the Solana network. The potential for further ETF offerings by major Canadian managers is anticipated to sustain capital inflows. As institutional interest swells, related protocols and networks may see increased activity and security improvements, benefiting from broader market acceptance. Insights suggest further growth as regulations evolve and market demand escalates.",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc1325dd37548f9ecad40/",
    "crawl_time": "2025-04-16T23:05:14.860790"
  },
  {
    "title": "3 Stocks Insiders are Buying Rapidly Amid Market Volatility",
    "author": "",
    "date": "",
    "content": "Within the first week of that drop, retail traders put $8.8 billion capital on the discounted line, according to Vanda Research. But now that SPX is up nearly 9% over a week, following tariff rollbacks, which stocks did insiders pick?\n\nThrough the previous bouts of stock volatility, GameStop managed to accrue $4.76 billion in cash and cash equivalents as of February 2025. By securing a large stake in an appreciating asset like Bitcoin, acting as digital gold, GameStop enters the playing field of exceedingly successful MicroStrategy.\n\nAnd just the fact that this gambit is now officially on the table is likely to further boost GME inflows, having been historically the primary meme stock since January 2021.\n\nJoin our Telegram group and never miss a breaking digital asset story.\n\nHallador Energy (HNRG), a key coal supplier to electric utilities, has seen its stock rise around 16% year-to-date. The primary catalyst? President Trump’s April 8th executive order, which aims to cut bureaucratic red tape and unlock America’s vast coal reserves. The order’s branding of the industry as ‘beautiful clean coal’ speaks volumes.\n\nMeanwhile, Energy Secretary Chris Wright has allocated $200 billion in financing to advance coal technologies and extraction. As Europe’s net-zero policies cripple industrial competitiveness, the U.S. is poised to strengthen its economic resilience – with Hallador Energy positioned to benefit from this paradigm shift.\n\nIn February, the company reported its Q4 2024 earnings, showing a strong cash position of $372.3 million. During 2024, Rocket spent $171.2 million on R&D and $102 million on admin, delivering a total net loss of $258.7 million. In November’s investor presentation, the company emphasized RP-A501 Phase I study, having shown progress on treating Danon disease.\n\nDisclaimer: The author does not hold or have a position in any securities discussed in the article. All stock prices were quoted at the time of writing.\n\nThe post 3 Stocks Insiders are Buying Rapidly Amid Market Volatility appeared first on Tokenist.",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc1367618da558f0591d6/",
    "crawl_time": "2025-04-16T23:05:21.105635"
  },
  {
    "title": "Price Action for TRUMP, PEPE Defies Logic After Large On-Chain Moves",
    "author": "",
    "date": "",
    "content": "Meanwhile, Lookonchain also flagged five wallets linked to privacy mixer Tornado Cash spending $4.28 million to acquire 611 billion PEPE tokens within the prior 8 hours.\n\nRelated: Official TRUMP Coin Price Analysis: Whale Dump Spurs 13.5% Drop in 24 Hours\n\nThe post Price Action for TRUMP, PEPE Defies Logic After Large On-Chain Moves appeared first on Coin Edition.",
    "images": [],
    "tags": [],
    "views": "0",
    "comments": "0",
    "url": "https://coinmarketcap.com/community/articles/67ffc1305dd37548f9ecad3e/",
    "crawl_time": "2025-04-16T23:05:27.738918"
  }
]